rows = [('Тих', 284, '2015231', 655), ('Авст', 197, '1383326', 447), ('Инд', 156, '1042923', 341),
        ('Арав', 120, '782418', 258), ('Афр', 233, '1336139', 460), ('Евраз', 289, '1447966', 511),
        ('САм', 244, '1187254', 426), ('ЮАм', 211, '986647', 360), ('Антаркт', 189, '01890', 189),
        ('ХдФ', 44, '61127', 29), ('Кокос', 51, '8934', 33), ('Филип', 88, '211849', 81)]
for n, m, s, p in rows:
    sols = []
    for i in range(1, len(s) - 1):
        for j in range(i + 1, len(s)):
            w, d, l = int(s[:i]), int(s[i:j]), int(s[j:])
            if w + d + l == m:
                sols.append((w, d, l, 3 * w + d == p))
    print(n, m, s, p, sols)
